#!/bin/bash

#2526 % 6 = 0

# Перевірка, чи є дійчними параметри
if ! [[ "$1" =~ ^[0-9]+$ && "$2" =~ ^[0-9]+$ ]]; then
  echo "Будь ласка, введіть два числових параметри."
  exit 1
fi

# Порівняння параметрів
if [ "$1" -gt "$2" ]; then
  echo "Перший параметр більше за другий."
  echo "Список псевдонімів (alias) вашої системи:"
  printf "$(cat ~/.bashrc | grep -e "^ *alias " | sed 's/^[ \t]*//')"
  exit 1
else
  echo "Перший параметр не більше за другий."
  echo "Розмір файлу скрипта ($(basename "$0")): $(stat --format="%s" $0) байт"
  exit 1
fi